/*************************************************************************
*                                                                        *
* Problem :                                                              *
* 끝자리 숫자계산                                                    *
*                                                                        *
*************************************************************************/
/*************************************************************************
*                                                                        *
* 국민대학교 전자정보통신대학 컴퓨터공학부 1 학년                        *
* 20153183 박호준                                                        *
*                                                                        *
*************************************************************************/
#include <stdio.h>
#include <stdlib.h>

int main(void) {
	FILE *in_file;
	int i, j;
	int no_cases, no_data;
	int data, p;

	in_file = fopen("input.txt", "r"); /*파일 열기*/
	if (in_file == NULL) exit(1);/*빈 파일일시 끝내기*/

	fscanf(in_file, "%d", &no_cases); /*케이스개수 받기*/

	for (i = 0; i < no_cases; i++)/*케이스 갯수만큼 코드 실행*/
	{
		fscanf(in_file, "%d", &no_data);/*받는 숫자의 갯수 받기*/
		p = 1;

			for (j = 0; j < no_data; j++)/*받는숫자의 갯수만큼 실행*/
			{
				fscanf(in_file, "%d", &data); /*받는숫자 받기*/
			
				if (data >= 100) {
					data %= 100;
				}
				p *= data;
				if (p >= 100) {
					p %= 100;
				}

			}/*받는숫자의 갯수만큼 실행 끝부분*/

		printf("%d\n", p );  
	}
	fclose(in_file);
	return 0;
}