/*************************************************************************
*                                                                        *
* Problem :                                                              *
*  요일 계산하기                                                         *
*                                                                        *
*************************************************************************/
/*************************************************************************
*                                                                        *
* 국민대학교 전자정보통신대학 컴퓨터공학부 1 학년                        *
* 20153183 박호준                                                        *
*                                                                        *
*************************************************************************/

#define _crt_secure_no_warnings
#include <stdio.h>
#include <stdlib.h>

int main(void) {
	FILE *in_file;
	int i, j;
	int no_cases;
	int y, m, d;

	in_file = fopen("input.txt", "r"); /*파일 열기*/
	if (in_file == NULL) exit(1);/*빈 파일일시 끝내기*/

	fscanf(in_file, "%d", &no_cases); /*케이스개수 받기*/


	for (i = 0; i < no_cases; i++)/*케이스 갯수만큼 코드 실행*/
	{
		fscanf(in_file, "%d %d %d", &y, &m, &d); /*받는숫자 받기*/

		for (j = 1582; j < y; j++) {
			if (((j % 4 == 0) && (j % 100 != 0)) || (j % 400 == 0)) {
				d += 366;
			}
			else {
				d += 365;
			}
		}
		for (j = 1; j < m; j++) {

			if (j == 1 || j == 3 || j == 5 || j == 7 || j == 8 || j == 10 || j == 12) { d += 31; }
			else if (j == 2) {
				if (((y % 4 == 0) && (y % 100 != 0)) || (y % 400 == 0)) {d += 29;}
				else {d += 28;}
			}
			else { d += 30; }
		}

		if ((d) % 7 == 0) { printf("4"); }
		if ((d) % 7 == 1) { printf("5"); }
		if ((d) % 7 == 2) { printf("6"); }
		if ((d) % 7 == 3) { printf("0"); }
		if ((d) % 7 == 4) { printf("1"); }
		if ((d) % 7 == 5) { printf("2"); }
		if ((d) % 7 == 6) { printf("3"); }

		printf("\n");
	}
	fclose(in_file);
	return 0;
}